In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({"shirtsize":['medium','small','xl','large']}) #Ordinal
df

  shirtsize
0    medium
1     small
2        xl
3     large

In [3]:
df['shirtsize'].unique()

array(['medium', 'small', 'xl', 'large'], dtype=object)

In [4]:
from sklearn.preprocessing import OrdinalEncoder
oe=OrdinalEncoder(categories=[['small', 'medium', 'large', 'xl']])
df['oe_shirt_size']=oe.fit_transform(df[['shirtsize']])

In [5]:
df['size_map']=(df['oe_shirt_size'].astype(int))

In [6]:
df

  shirtsize  oe_shirt_size  size_map
0    medium            1.0         1
1     small            0.0         0
2        xl            3.0         3
3     large            2.0         2

In [7]:
df2=pd.DataFrame({"city":['bom','shimla','delhi','bom']}) #Nominal
df2

     city
0     bom
1  shimla
2   delhi
3     bom

In [8]:
pd.get_dummies(df2['city'],drop_first=False,dtype=int)

   bom  delhi  shimla
0    1      0       0
1    0      0       1
2    0      1       0
3    1      0       0

In [9]:
from sklearn.preprocessing import LabelEncoder # LabelEncoder categorises based on alphabetical order
le=LabelEncoder()
df2['le_city']=le.fit_transform(df2['city'])

In [10]:
df2

     city  le_city
0     bom        0
1  shimla        2
2   delhi        1
3     bom        0